Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Commit(System.Boolean)
Finishes the edit scope.
Remarks:
All the changes made after starting the EditScope will be committed. Changes will be merged into one transaction.
If the appearance asset element is used in one or more materials, they will be updated to match any changes made.
Open views may not redraw after changes. View update can be forced with the input argument, but doing so can be an expensive operation.
Consider using false if immediate update is not needed or if multiple calls to this method are used in a loop.
updateOpenViews:
When true, force update of the open views.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
EditScope is not active. EditScope can only be committed or cancelled when it is active.
-or-
EditScope cannot be closed, there is no opened transaction.
-or-
The editable asset is not valid.
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Cancel
Cancels the edit scope.
Remarks:
All the changes made after starting the EditScope will be discarded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
EditScope is not active. EditScope can only be committed or cancelled when it is active.
-or-
EditScope cannot be closed, there is no opened transaction.
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts the edit scope.
assetElementId:
The appearance asset element whose asset should be edited.
Returns:
The appearance asset to be used for editing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.IsActive
Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
Remarks:
Starting the edit scope is not permitted when it is active.
Canceling/committing is not allowed   when the edit scope is not active.
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.#ctor(Autodesk.Revit.DB.Document)
Constructs a new instance of an AppearanceAssetEditScope.
document:
The document for which this EditScope is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope
A scope object that provides special access and limitations related to editing appearance assets and their related elements.
Remarks:
You can use an AppearanceAssetEditScope to modify the values of the properties of appearance assets and connected assets (such as bitmaps).  The following restrictions apply:
A single edit scope is allowed only to edit one top level rendering assets (and its connected assets).  To edit more than one appearance asset you must start a different edit scope.An edit scope may be reused for editing another asset, so long as it has been committed or canceled before using start to associate it to a new asset.Multiple changes to the asset are allowed before commit.A transaction must be started before using Commit() on the edited asset. The transaction may be opened before or after the edit scope is started, but must be open to allow the changes into the model.
Since:
2018.1